flyghost/OneOS-V2.1.0/drivers/hal/hdsc/HC32F4Ax_HAL/sdk/src/hc32f4a0_event_port.c
/**
 *******************************************************************************
 * @file  hc32f4a0_event_port.c
 * @brief This file provides firmware functions to manage the Event Port (EP).
 @verbatim
   Change Logs:
   Date             Author          Notes
   2020-12-15       Zhangxl         First version
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2020, Huada Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by HDSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 *
 *******************************************************************************
 */

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32f4a0_event_port.h"
#include "hc32f4a0_utility.h"

/**
 * @addtogroup HC32F4A0_DDL_Driver
 * @{
 */

/**
 * @defgroup DDL_EVENT_PORT EP
 * @brief EP Driver Library
 * @{
 */

#if (DDL_EVENT_PORT_ENABLE == DDL_ON)

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/
/**
 * @defgroup EP_Local_Macros EP Local Macros
 * @{
 */
#define EP1_BASE        (0x40010800UL + 0x0100UL)
#define EP2_BASE        (0x40010800UL + 0x011CUL)
#define EP3_BASE        (0x40010800UL + 0x0138UL)
#define EP4_BASE        (0x40010800UL + 0x0154UL)
#define EP1_DIR_BASE    (0x00UL)
#define EP1_IDR_BASE    (0x04UL)
#define EP1_ODR_BASE    (0x08UL)
#define EP1_ORR_BASE    (0x0CUL)
#define EP1_OSR_BASE    (0x10UL)
#define EP1_RISR_BASE   (0x14UL)
#define EP1_FAL_BASE    (0x18UL)
#define EP_NFCR_BASE    (0x40010800UL + 0x0170UL)

/**
 * @defgroup EP_Check_Parameters_Validity EP Check Parameters Validity
 * @{
 */
/*! Parameter validity check for port group. */
#define IS_EVENT_PORT(port)                                                     \
(   ((port) == EVENT_PORT_1)                    ||                              \
    ((port) == EVENT_PORT_2)                    ||                              \
    ((port) == EVENT_PORT_3)                    ||                              \
    ((port) == EVENT_PORT_4))

/*! Parameter validity check for pin. */
#define IS_EVENT_PIN(pin)               (((pin) & EVENT_PIN_MASK ) != 0x0000U)

/*! Parameter valid check for event port common trigger configuration. */
#define IS_EP_COM_TRIG(comtrig)                                                 \
(   ((comtrig) != 0x00UL)                       &&                              \
    (((comtrig) | EP_COM_TRIG_MASK) == EP_COM_TRIG_MASK))

/*! Parameter valid check for event port operation after triggered. */
#define IS_EP_OPS(ops)                                                          \
(   ((ops) == EP_OPS_NONE)                      ||                              \
    ((ops) == EP_OPS_LOW)                       ||                              \
    ((ops) == EP_OPS_HIGH)                      ||                              \
    ((ops) == EP_OPS_TOGGLE))

/*! Parameter valid check for event port trigger edge. */
#define IS_EP_TRIG_EDGE(edge)                                                   \
(   ((edge) == EP_TRIGGER_NONE)                 ||                              \
    ((edge) == EP_TRIGGER_FALLING)              ||                              \
    ((edge) == EP_TRIGGER_RISING)               ||                              \
    ((edge) == EP_TRIGGER_BOTH))

/*! Parameter valid check for event port direction. */
#define IS_EP_DIR(dir)                                                          \
(   ((dir) == EP_DIR_IN)                        ||                              \
    ((dir) == EP_DIR_OUT))

/*! Parameter valid check for event port filter function. */
#define IS_EP_FILTER(filter)                                                    \
(   ((filter) == EP_FILTER_OFF)                 ||                              \
    ((filter) == EP_FILTER_ON))

/*! Parameter valid check for event port filter clock div. */
#define IS_EP_FILTER_CLK(clk)                                                   \
(   ((clk) == EP_FCLK_PCLK_DIV1)                ||                              \
    ((clk) == EP_FCLK_PCLK_DIV8)                ||                              \
    ((clk) == EP_FCLK_PCLK_DIV32)               ||                              \
    ((clk) == EP_FCLK_PCLK_DIV64))

/*! Parameter valid check for event port initial output state. */
#define IS_EP_STATE(state)                                                      \
(   ((state) == Event_Pin_Reset)                ||                              \
    ((state) == Event_Pin_Set))

/**
 * @}
 */

/**
 * @}
 */

/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/

/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/

/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/

/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/
/**
 *******************************************************************************
 ** \brief   Event Port init
 **
 ** \param   [in]  u8EventPort          Event port index, This parameter can be
 **                                     any value of @ref EP_Port_source
 ** \param   [in]  u16EventPin          Event pin index, This parameter can be
 **                                     any composed value of @ref EP_pins_define
 ** \param   [in]  pstcEventPortInit    Structure pointer of event port configuration
 **
 ** \retval  Ok                         Init successful
 **          ErrorInvalidParameter      Event port index invalid
 **
 ******************************************************************************/
/**
 * @brief  Initialize Event Port.
 * @param  [in] u8EventPort: EVENT_PORT_x, x can be (1~4) to select the EP port peripheral
 * @param  [in] u16EventPin: EVENT_PIN_x, x can be (00~15) to select the EP pin index
 * @param  [in] pstcEventPortInit Pointer to a stc_ep_init_t structure that
 *                                contains configuration information.
 * @retval Ok: Event Port initialize successful
 *         ErrorInvalidParameter: NULL pointer
 */
en_result_t EP_Init(uint8_t u8EventPort, uint16_t u16EventPin, const stc_ep_init_t *pstcEventPortInit)
{
    uint16_t u16PinPos;
    __IO uint32_t *EPDIRx;                  /* Direction register */
    __IO uint32_t *EPODRx;                  /* Output data register */
    __IO uint32_t *EPORRx;                  /* Reset after trigger enable register */
    __IO uint32_t *EPOSRx;                  /* Set after trigger enable register */
    __IO uint32_t *EPRISRx;                 /* Rising edge detect enable register */
    __IO uint32_t *EPFALx;                  /* Falling edge detect enable register */
    en_result_t enRet = Ok;

    EPDIRx = (__IO uint32_t *)(EP1_BASE + EP1_DIR_BASE + (0x1CUL * u8EventPort));
    EPODRx = (__IO uint32_t *)(EP1_BASE + EP1_ODR_BASE + (0x1CUL * u8EventPort));
    EPORRx = (__IO uint32_t *)(EP1_BASE + EP1_ORR_BASE + (0x1CUL * u8EventPort));
    EPOSRx = (__IO uint32_t *)(EP1_BASE + EP1_OSR_BASE + (0x1CUL * u8EventPort));
    EPRISRx= (__IO uint32_t *)(EP1_BASE + EP1_RISR_BASE+ (0x1CUL * u8EventPort));
    EPFALx = (__IO uint32_t *)(EP1_BASE + EP1_FAL_BASE + (0x1CUL * u8EventPort));

    if (NULL == pstcEventPortInit)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        DDL_ASSERT(IS_EVENT_PORT(u8EventPort));
        DDL_ASSERT(IS_EVENT_PIN(u16EventPin));
        DDL_ASSERT(IS_EP_OPS(pstcEventPortInit->u32PinTriggerOps));
        DDL_ASSERT(IS_EP_TRIG_EDGE(pstcEventPortInit->u32TriggerEdge));
        DDL_ASSERT(IS_EP_DIR(pstcEventPortInit->u32PinDir));
        DDL_ASSERT(IS_EP_FILTER(pstcEventPortInit->u32Filter));
        DDL_ASSERT(IS_EP_FILTER_CLK(pstcEventPortInit->u32FilterClk));
        DDL_ASSERT(IS_EP_STATE(pstcEventPortInit->enPinState));

