flyghost/OneOS-V2.1.0/drivers/hal/hdsc/HC32F4Ax_HAL/sdk/src/hc32f4a0_event_port.c
        for (u16PinPos = 0U; u16PinPos < 16U; u16PinPos++)
        {
            if ((u16EventPin & (1UL<<u16PinPos)) != 0U)
            {
                /* Direction config */
                if (EP_DIR_OUT == pstcEventPortInit->u32PinDir)
                {
                    SET_REG32_BIT(*EPDIRx, u16EventPin);
                }
                else
                {
                    CLEAR_REG32_BIT(*EPDIRx, u16EventPin);
                }
                /* Set pin initial output value */
                if (Event_Pin_Set == pstcEventPortInit->enPinState)
                {
                    SET_REG32_BIT(*EPODRx, u16EventPin);
                }
                else
                {
                    CLEAR_REG32_BIT(*EPODRx, u16EventPin);
                }
                /* Set Pin operation after triggered */
                switch (pstcEventPortInit->u32PinTriggerOps)
                {
                    case EP_OPS_NONE:
                        CLEAR_REG32_BIT(*EPORRx, u16EventPin);
                        CLEAR_REG32_BIT(*EPOSRx, u16EventPin);
                        break;
                    case EP_OPS_LOW:
                        SET_REG32_BIT(*EPORRx, u16EventPin);
                        CLEAR_REG32_BIT(*EPOSRx, u16EventPin);
                        break;
                    case EP_OPS_HIGH:
                        CLEAR_REG32_BIT(*EPORRx, u16EventPin);
                        SET_REG32_BIT(*EPOSRx, u16EventPin);
                        break;
                    case EP_OPS_TOGGLE:
                        SET_REG32_BIT(*EPORRx, u16EventPin);
                        SET_REG32_BIT(*EPOSRx, u16EventPin);
                        break;
                    default:
                        enRet = ErrorInvalidParameter;
                        break;
                }
                /* Set trigger edge */
                switch (pstcEventPortInit->u32TriggerEdge)
                {
                    case EP_TRIGGER_NONE:
                        CLEAR_REG32_BIT(*EPFALx, u16EventPin);
                        CLEAR_REG32_BIT(*EPRISRx, u16EventPin);
                        break;
                    case EP_TRIGGER_FALLING:
                        SET_REG32_BIT(*EPFALx, u16EventPin);
                        CLEAR_REG32_BIT(*EPRISRx, u16EventPin);
                        break;
                    case EP_TRIGGER_RISING:
                        CLEAR_REG32_BIT(*EPFALx, u16EventPin);
                        SET_REG32_BIT(*EPRISRx, u16EventPin);
                        break;
                    case EP_TRIGGER_BOTH:
                        SET_REG32_BIT(*EPFALx, u16EventPin);
                        SET_REG32_BIT(*EPRISRx, u16EventPin);
                        break;
                    default:
                        enRet = ErrorInvalidParameter;
                        break;
                }
            }
            switch (u8EventPort)
            {
                case EVENT_PORT_1:
                    MODIFY_REG32(M4_AOS->PEVNTNFCR,                             \
                                (pstcEventPortInit->u32Filter |                 \
                                 pstcEventPortInit->u32FilterClk),              \
                                (AOS_PEVNTNFCR_NFEN1 |AOS_PEVNTNFCR_DIVS1));
                    break;
                case EVENT_PORT_2:
                    MODIFY_REG32(M4_AOS->PEVNTNFCR,                             \
                                (pstcEventPortInit->u32Filter |                 \
                                 pstcEventPortInit->u32FilterClk) << 8UL,       \
                                (AOS_PEVNTNFCR_NFEN2 | AOS_PEVNTNFCR_DIVS2));
                    break;
                case EVENT_PORT_3:
                    MODIFY_REG32(M4_AOS->PEVNTNFCR,                             \
                                (pstcEventPortInit->u32Filter |                 \
                                 pstcEventPortInit->u32FilterClk) << 16UL,      \
                                (AOS_PEVNTNFCR_NFEN3 | AOS_PEVNTNFCR_DIVS3));
                    break;
                case EVENT_PORT_4:
                    MODIFY_REG32(M4_AOS->PEVNTNFCR,                             \
                                (pstcEventPortInit->u32Filter |                 \
                                 pstcEventPortInit->u32FilterClk) << 24UL,      \
                                (AOS_PEVNTNFCR_NFEN4 | AOS_PEVNTNFCR_DIVS4));
                    break;
                default:
                    enRet = ErrorInvalidParameter;
                    break;
            }
        }
    }
    return enRet;
}

/**
 * @brief  De-init Event Port register to default value
 * @param  None
 * @retval None
 */
void EP_DeInit(void)
{
    __IO uint32_t EPDIRx ;
    __IO uint32_t EPODRx ;
    __IO uint32_t EPORRx ;
    __IO uint32_t EPOSRx ;
    __IO uint32_t EPRISRx;
    __IO uint32_t EPFALx ;
    uint8_t u8EPCnt;

    EPDIRx = (uint32_t)(EP1_BASE + EP1_DIR_BASE);
    EPODRx = (uint32_t)(EP1_BASE + EP1_ODR_BASE);
    EPORRx = (uint32_t)(EP1_BASE + EP1_ORR_BASE);
    EPOSRx = (uint32_t)(EP1_BASE + EP1_OSR_BASE);
    EPRISRx= (uint32_t)(EP1_BASE + EP1_RISR_BASE);
    EPFALx = (uint32_t)(EP1_BASE + EP1_FAL_BASE);

    /* Restore all registers to default value */
    M4_AOS->PEVNTTRGSR12 = 0x1FFUL;
    M4_AOS->PEVNTTRGSR34 = 0x1FFUL;
    M4_AOS->PEVNTNFCR = 0UL;
    for (u8EPCnt = 0U; u8EPCnt < 4U; u8EPCnt++)
    {
        *(__IO uint32_t *)(EPDIRx + 0x1CUL * u8EPCnt) = 0UL;
        *(__IO uint32_t *)(EPODRx + 0x1CUL * u8EPCnt) = 0UL;
        *(__IO uint32_t *)(EPORRx + 0x1CUL * u8EPCnt) = 0UL;
        *(__IO uint32_t *)(EPOSRx + 0x1CUL * u8EPCnt) = 0UL;
        *(__IO uint32_t *)(EPRISRx+ 0x1CUL * u8EPCnt) = 0UL;
        *(__IO uint32_t *)(EPFALx + 0x1CUL * u8EPCnt) = 0UL;
    }
}

/**
 * @brief  Initialize Event Port config structure. Fill each pstcEventPortInit with default value
 * @param  [in] pstcEventPortInit: Pointer to a stc_ep_init_t structure that
 *                                 contains configuration information.
 * @retval Ok: Event Port structure initialize successful
 *         ErrorInvalidParameter: NULL pointer
 */
en_result_t EP_StructInit(stc_ep_init_t *pstcEventPortInit)
{
    en_result_t enRet = Ok;
    /* Check if pointer is NULL */
    if (NULL == pstcEventPortInit)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Reset Event Port init structure parameters values */
        pstcEventPortInit->u32PinDir        = EP_DIR_IN;
        pstcEventPortInit->enPinState       = Event_Pin_Reset;
        pstcEventPortInit->u32PinTriggerOps = EP_OPS_NONE;
        pstcEventPortInit->u32TriggerEdge   = EP_TRIGGER_NONE;
        pstcEventPortInit->u32Filter        = EP_FILTER_OFF;
        pstcEventPortInit->u32FilterClk     = EP_FCLK_PCLK_DIV1;
    }
    return enRet;
}

en_result_t EP_SetTriggerEdge(uint8_t u8EventPort, uint16_t u16EventPin, uint32_t u32Edge)
{
    __IO uint32_t *EPRISRx;
    __IO uint32_t *EPFALx;
    en_result_t enRet = Ok;

