flyghost/OneOS-V2.1.0/drivers/hal/hdsc/HC32F4Ax_HAL/sdk/src/hc32f4a0_event_port.c
    DDL_ASSERT(IS_EVENT_PORT(u8EventPort));
    DDL_ASSERT(IS_EVENT_PIN(u16EventPin));
    DDL_ASSERT(IS_EP_TRIG_EDGE(u32Edge));

    EPRISRx= (__IO uint32_t *)(EP1_BASE + EP1_RISR_BASE+ (0x1CUL * u8EventPort));
    EPFALx = (__IO uint32_t *)(EP1_BASE + EP1_FAL_BASE + (0x1CUL * u8EventPort));

    /* Set trigger edge */
    switch (u32Edge)
    {
        case EP_TRIGGER_NONE:
            CLEAR_REG32_BIT(*EPFALx, u16EventPin);
            CLEAR_REG32_BIT(*EPRISRx, u16EventPin);
            break;
        case EP_TRIGGER_FALLING:
            SET_REG32_BIT(*EPFALx, u16EventPin);
            CLEAR_REG32_BIT(*EPRISRx, u16EventPin);
            break;
        case EP_TRIGGER_RISING:
            CLEAR_REG32_BIT(*EPFALx, u16EventPin);
            SET_REG32_BIT(*EPRISRx, u16EventPin);
            break;
        case EP_TRIGGER_BOTH:
            SET_REG32_BIT(*EPFALx, u16EventPin);
            SET_REG32_BIT(*EPRISRx, u16EventPin);
            break;
        default:
            enRet = ErrorInvalidParameter;
            break;
    }
    return enRet;
}


en_result_t EP_SetTriggerOps(uint8_t u8EventPort, uint16_t u16EventPin, uint32_t u32Ops)
{
    __IO uint32_t *EPORRx;
    __IO uint32_t *EPOSRx;
    en_result_t enRet = Ok;

    DDL_ASSERT(IS_EVENT_PORT(u8EventPort));
    DDL_ASSERT(IS_EVENT_PIN(u16EventPin));
    DDL_ASSERT(IS_EP_OPS(u32Ops));

    EPORRx = (__IO uint32_t *)(EP1_BASE + EP1_ORR_BASE + (0x1CUL * u8EventPort));
    EPOSRx = (__IO uint32_t *)(EP1_BASE + EP1_OSR_BASE + (0x1CUL * u8EventPort));

    switch (u32Ops)
    {
        case EP_OPS_NONE:
            CLEAR_REG32_BIT(*EPORRx, u16EventPin);
            CLEAR_REG32_BIT(*EPOSRx, u16EventPin);
            break;
        case EP_OPS_LOW:
            SET_REG32_BIT(*EPORRx, u16EventPin);
            CLEAR_REG32_BIT(*EPOSRx, u16EventPin);
            break;
        case EP_OPS_HIGH:
            CLEAR_REG32_BIT(*EPORRx, u16EventPin);
            SET_REG32_BIT(*EPOSRx, u16EventPin);
            break;
        case EP_OPS_TOGGLE:
            SET_REG32_BIT(*EPORRx, u16EventPin);
            SET_REG32_BIT(*EPOSRx, u16EventPin);
            break;
        default:
            enRet = ErrorInvalidParameter;
            break;
    }
    return enRet;
}

/**
 * @brief  Event Port Hardware trigger event configuration
 * @param  [in] u8EventPort     Event port index, This parameter can be any value
 *                              @ref EP_Port_source
 * @param  [in] enEvent         Event configuration for event port hardware trigger
 *                              @ref en_event_src_t
 * @retval None
 */
void EP_SetTriggerSrc(uint8_t u8EventPort, en_event_src_t enEvent)
{
    __IO uint32_t *EP_TRGSRx;

    DDL_ASSERT(IS_EVENT_PORT(u8EventPort));

    EP_TRGSRx = (__IO uint32_t *)((uint32_t)&M4_AOS->PEVNTTRGSR12 + (4UL * ((uint32_t)u8EventPort/2UL)));
    MODIFY_REG32(*EP_TRGSRx, AOS_PEVNTTRGSR_TRGSEL, enEvent);
}

/**
 * @brief  Event Port Hardware trigger common event function command
 * @param  [in] u8EventPort     EVENT_PORT_x, x can be (1~4) to select the EP port peripheral
 * @param  [in] u32ComTrig      Common trigger event enable.
 *                              This parameter can be one of the following values:
 *   @arg  EP_COM_TRIG1: Common trigger event 1.
 *   @arg  EP_COM_TRIG2: Common trigger event 2.
 * @param  [in] enNewState      New state of common trigger function.
 * @retval none
 */
void EP_ComTriggerCmd(uint8_t u8EventPort, uint32_t u32ComTrig, en_functional_state_t enNewState)
{
    __IO uint32_t *EP_TRGSRx;

    DDL_ASSERT(IS_EVENT_PORT(u8EventPort));
    DDL_ASSERT(IS_EP_COM_TRIG(u32ComTrig));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    EP_TRGSRx = (__IO uint32_t *)((uint32_t)&M4_AOS->PEVNTTRGSR12 + (4UL * ((uint32_t)u8EventPort/2UL)));

    if (Enable == enNewState)
    {
        SET_REG32_BIT(*EP_TRGSRx, u32ComTrig);
    }
    else
    {
        CLEAR_REG32_BIT(*EP_TRGSRx, u32ComTrig);
    }
}

/**
 * @brief  Read specified Event port input data port pins
 * @param  [in] u8EventPort: EVENT_PORT_x, x can be (1~4) to select the EP peripheral
 * @param  [in] u16EventPin: EVENT_PIN_x, x can be (00~15) to select the EP pin index
 * @retval Specified Event port pin input value
 */
en_ep_state_t EP_ReadInputPins(uint8_t u8EventPort, uint16_t u16EventPin)
{
    __IO uint32_t *PEVNTIDRx;

    DDL_ASSERT(IS_EVENT_PORT(u8EventPort));
    DDL_ASSERT(IS_EVENT_PIN(u16EventPin));

    PEVNTIDRx = (__IO uint32_t *)((uint32_t)(&M4_AOS->PEVNTIDR1) + (0x1CUL * u8EventPort));

    return ((READ_REG32(*PEVNTIDRx) & (u16EventPin)) != 0UL) ? Event_Pin_Set : Event_Pin_Reset;
}

/**
 * @brief  Read specified Event port input data port
 * @param  [in] u8EventPort: EVENT_PORT_x, x can be (1~4) to select the Event Port peripheral
 * @retval Specified Event Port input value
 */
uint16_t EP_ReadInputPort(uint8_t u8EventPort)
{
    __IO uint32_t *PEVNTIDRx;

    DDL_ASSERT(IS_EVENT_PORT(u8EventPort));

    PEVNTIDRx = (__IO uint32_t *)((uint32_t)(&M4_AOS->PEVNTIDR1) + (0x1CUL * u8EventPort));
    return (uint16_t)(READ_REG32(*PEVNTIDRx) & 0xFFFFUL);
}

/**
 * @brief  Read specified Event port output data port pins
 * @param  [in] u8EventPort: EVENT_PORT_x, x can be (1~4) to select the EP peripheral
 * @param  [in] u16EventPin: EVENT_PIN_x, x can be (00~15) to select the EP pin index
 * @retval Specified Event port pin output value
 */
en_ep_state_t EP_ReadOutputPins(uint8_t u8EventPort, uint16_t u16EventPin)
{
    __IO uint32_t *PEVNTODRx;

    DDL_ASSERT(IS_EVENT_PORT(u8EventPort));
    DDL_ASSERT(IS_EVENT_PIN(u16EventPin));

    PEVNTODRx = (__IO uint32_t *)((uint32_t)(&M4_AOS->PEVNTODR1) + (0x1CUL * u8EventPort));
    return ((READ_REG32(*PEVNTODRx) & (u16EventPin)) != 0UL) ? Event_Pin_Set : Event_Pin_Reset;
}

/**
 * @brief  Read specified Event port output data port
 * @param  [in] u8EventPort: EVENT_PORT_x, x can be (1~4) to select the Event Port peripheral
 * @retval Specified Event Port output value
 */
uint16_t EP_ReadOutputPort(uint8_t u8EventPort)
{
    __IO uint32_t *PEVNTODRx;

