flyghost/OneOS-V2.1.0/drivers/hal/hdsc/HC32F4Ax_HAL/sdk/src/hc32f4a0_event_port.c
    DDL_ASSERT(IS_EVENT_PORT(u8EventPort));

    PEVNTODRx = (__IO uint32_t *)((uint32_t)(&M4_AOS->PEVNTODR1) + (0x1CUL * u8EventPort));
    return (uint16_t)(READ_REG32(*PEVNTODRx) & 0xFFFFUL);
}

/**
 * @brief  Set specified Event port output data port pins
 * @param  [in] u8EventPort: EVENT_PORT_x, x can be (1~4) to select the EP peripheral
 * @param  [in] u16EventPin: EVENT_PIN_x, x can be (00~15) to select the EP pin index
 * @retval None
 */
void EP_SetPins(uint8_t u8EventPort, uint16_t u16EventPin)
{
    __IO uint32_t *PEVNTODRx;

    DDL_ASSERT(IS_EVENT_PORT(u8EventPort));
    DDL_ASSERT(IS_EVENT_PIN(u16EventPin));

    PEVNTODRx = (__IO uint32_t *)((uint32_t)(&M4_AOS->PEVNTODR1) + (0x1CUL * u8EventPort));

    SET_REG32_BIT(*PEVNTODRx, u16EventPin);
}

/**
 * @brief  Reset specified Event port output data port pins
 * @param  [in] u8EventPort: EVENT_PORT_x, x can be (1~4) to select the EP peripheral
 * @param  [in] u16EventPin: EVENT_PIN_x, x can be (00~15) to select the EP pin index
 * @retval None
 */
void EP_ResetPins(uint8_t u8EventPort, uint16_t u16EventPin)
{
    __IO uint32_t *PEVNTODRx;

    DDL_ASSERT(IS_EVENT_PORT(u8EventPort));
    DDL_ASSERT(IS_EVENT_PIN(u16EventPin));

    PEVNTODRx = (__IO uint32_t *)((uint32_t)(&M4_AOS->PEVNTODR1) + (0x1CUL * u8EventPort));

    CLEAR_REG32_BIT(*PEVNTODRx, u16EventPin);
}

/**
 * @brief  Set specified Event port pins direction
 * @param  [in] u8EventPort: EVENT_PORT_x, x can be (1~4) to select the EP peripheral
 * @param  [in] u16EventPin: EVENT_PIN_x, x can be (00~15) to select the EP pin index
 * @param  [in] u32Dir: Pin direction
 *   @arg  EP_DIR_IN
 *   @arg  EP_DIR_OUT
 * @retval None
 */
void EP_SetDir(uint8_t u8EventPort, uint16_t u16EventPin, uint32_t u32Dir)
{
    __IO uint32_t *EPDIRx;                  /* Direction register */

    DDL_ASSERT(IS_EVENT_PORT(u8EventPort));
    DDL_ASSERT(IS_EVENT_PIN(u16EventPin));
    DDL_ASSERT(IS_EP_DIR(u32Dir));

    EPDIRx = (__IO uint32_t *)(EP1_BASE + EP1_DIR_BASE + (0x1CUL * u8EventPort));

    if (EP_DIR_OUT == u32Dir)
    {
        SET_REG32_BIT(*EPDIRx, u16EventPin);
    }
    else
    {
        CLEAR_REG32_BIT(*EPDIRx, u16EventPin);
    }
}

/**
 * @}
 */

#endif /* DDL_EVENT_PORT_ENABLE */

/**
 * @}
 */

/**
* @}
*/

/******************************************************************************
 * EOF (not truncated)
 *****************************************************************************/
